# SolidglassTransmittance Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SolidGlass..::..SolidglassTransmittance Property
SolidGlass Class See Also
---
The property labeled "Color" from the "SolidGlass" schema.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public static string SolidglassTransmittance { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SolidglassTransmittance As String
	Get
```

Visual C++
---
```text
public:
static property String^ SolidglassTransmittance {
	String^ get ();
}
```

# Remarks
This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "SolidglassTransmittanceType".
# See Also
SolidGlass Class
Autodesk.Revit.DB.Visual Namespace